# Въвежда се дума (само с главни букви от латинската азбука) и след нея се въвежда цифра (N). За всяка дума се взимат последните (N) букви и се слагат най-отпред на думата (не забравяйте да махнете последните букви от думата след преместването им).
# В допълнение, заменете всяка буква, от получената думата, с буква N символа след нея в азбуката.
azbuka = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'
word = input()
N = int(input())
word = word[-N:] + word[:-N]
crypt = ''
for i in word:
    crypt += azbuka[azbuka.index(i) + N]
print(crypt)
